{
  "backend/main.mo": "Main Motoko actor implementing user profiles, tablature sequences, and fingering configurations with role-based access control (admin/user) and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting the fix for the 'Actor not available' error in useBackendFingerings.ts and useBackendSequences.ts, replacing the raw error with a user-friendly 'Connecting to the network' message.",
  "frontend-file-summaries.txt": "Truncated JSON file containing one-sentence summaries of all frontend source files, covering hooks, components, utilities, and configuration modules.",
  "frontend/index.css": "Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, charts, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the Ocarina Music App that mounts the React app at the #root div and loads the Vite entry point.",
  "frontend/src/App.tsx": "Root React component setting up TanStack Router with two routes (MainPage at '/' and AdminFingeringConfig at '/admin'), a shared layout with Toaster, and a footer attribution link.",
  "frontend/src/components/InstrumentSelector.tsx": "Dropdown component using shadcn Select to choose an instrument from the INSTRUMENTS config, currently listing only the Ocarina.",
  "frontend/src/components/Ocarina3DModel.tsx": "React Three Fiber component rendering an animated turtle-shaped 3D ocarina with shell, head, flippers, tone holes, and fingertip meshes that animate based on the active fingering prop.",
  "frontend/src/components/OcarinaScene.tsx": "Canvas wrapper that sets up lighting, shadows, OrbitControls, and renders the Ocarina3DModel inside a React Three Fiber scene with a transparent background.",
  "frontend/src/components/PianoKeyboard.tsx": "Renders an interactive piano keyboard component with white and black keys, mouse event handlers for note start/end, and an octave selector UI.",
  "frontend/src/components/SequenceList.tsx": "Displays a scrollable list of saved musical sequences with note count, duration, and a preview of the first 12 notes; clicking a sequence triggers playback.",
  "frontend/src/components/SheetMusicView.tsx": "Renders a basic SVG sheet music view of a recorded note sequence, mapping notes to staff positions with ledger lines, a treble clef, and whole/half/quarter note glyphs.",
  "frontend/src/components/TablaturePanel.tsx": "Shows fingering diagrams for each note in a recorded sequence using a turtle-shaped SVG hole diagram, with note name and duration labels.",
  "frontend/src/config/instruments.ts": "Defines the InstrumentConfig interface and a list of available instruments (currently only Ocarina), with a helper to look up an instrument by ID.",
  "frontend/src/constants/fingeringMap.ts": "Defines the Fingering and FingeringMap types, hole labels, and a default 12-note ocarina fingering map mapping note names to four-hole boolean arrays.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous Internet Computer actor using the current identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendFingerings.ts": "Provides React Query hooks for fetching all fingerings from the backend (falling back to defaults) and saving a fingering, with error message extraction utilities.",
  "frontend/src/hooks/useBackendSequences.ts": "Provides React Query hooks for fetching all saved sequences from the backend and saving a new sequence, with BigInt normalization and error message extraction.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, wrapping DFINITY's AuthClient to expose login, logout, and identity state with status tracking.",
  "frontend/src/hooks/useOcarinaAudio.ts": "Custom hook that manages Web Audio API oscillators to play and stop ocarina-like tones using blended sine waves with attack/release envelopes.",
  "frontend/src/hooks/useQueries.ts": "Re-exports all backend query hooks for fingerings and sequences from their respective modules as a convenience barrel file.",
  "frontend/src/hooks/useRecording.ts": "Custom hook for recording note sequences with timing, tracking note start/end times to produce duration-stamped entries convertible to TablatureEntry format.",
  "frontend/src/index.css": "Global stylesheet importing Cinzel and Lora fonts, defining a warm parchment-themed CSS variable palette for light/dark modes, and adding utility component classes for parchment, wood, and stone texture panels.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminFingeringConfig.tsx": "Admin page for viewing and editing ocarina fingering configurations per note, with authentication-gated save functionality backed by the backend fingering API.",
  "frontend/src/pages/MainPage.tsx": "Main application page combining the ocarina scene, piano keyboard, sheet music, tablature, and sequence list, with note playback, recording, and authenticated melody saving.",
  "frontend/src/utils/audioUtils.ts": "Utility functions for converting note names to frequencies using equal temperament tuning, extracting note components, and formatting durations as musical symbols.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom fonts (Cinzel, Lora), OKLCH-based semantic color palettes (terracotta, amber, forest, parchment), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state snapshot for a Caffeine AI ocarina music app, documenting existing features, architectural notes, known issues (actor initialization errors), and versioned feature/requirement mappings."
}